IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G0_EPWM7_CONTROLSS_G0_EPWM7.xml
	<register id="CONTROLSS_G0_EPWM7_DCFWINDOWCNT" acronym="CONTROLSS_G0_EPWM7_DCFWINDOWCNT" offset="0x198" width="16" description="Digital Compare Filter Window Counter Register">
		<bitfield id="DCFWINDOWCNT" width="16" begin="15" end="0" resetval="0x0" description="Blanking Window Counter  These 16 bits are read only and indicate the current value of the window counter. The counter counts down to zero and then stops until it is re-loaded when the offset counter reaches zero again." range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G0_EPWM7_BLANKPULSEMIXSEL" acronym="CONTROLSS_G0_EPWM7_BLANKPULSEMIXSEL" offset="0x19A" width="16" description="Blanking window trigger pulse select register">
		<bitfield id="CDD" width="1" begin="9" end="9" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is decrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPD down-count match enable event is not enabled  1: Enable CMPD down-count match enable event" range="9" rwaccess="R/W"/> 
		<bitfield id="CDU" width="1" begin="8" end="8" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is incrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPD up-count match enable event is not enabled  1: Enable CMPD up-count match enable event" range="8" rwaccess="R/W"/> 
		<bitfield id="CCD" width="1" begin="7" end="7" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is decrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPC down-count match enable event is not enabled  1: Enable CMPC down-count match enable event" range="7" rwaccess="R/W"/> 
		<bitfield id="CCU" width="1" begin="6" end="6" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is incrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPC up-count match enable event is not enabled  1: Enable CMPC up-count match enable event" range="6" rwaccess="R/W"/> 
		<bitfield id="CBD" width="1" begin="5" end="5" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is decrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPB down-count match enable event is not enabled  1: Enable CMPB down-count match enable event" range="5" rwaccess="R/W"/> 
		<bitfield id="CBU" width="1" begin="4" end="4" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is incrementing to the mixed ET interrupt trigger signal [BLANKPULSEMIX].    0: CMPB up-count match enable event is not enabled  1: Enable CMPB up-count match enable event" range="4" rwaccess="R/W"/> 
		<bitfield id="CAD" width="1" begin="3" end="3" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is decrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPA down-count match enable event is not enabled  1: Enable CMPA down-count match enable event" range="3" rwaccess="R/W"/> 
		<bitfield id="CAU" width="1" begin="2" end="2" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is incrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPA up-count match enable event is not enabled  1: Enable CMPA up-count match enable event" range="2" rwaccess="R/W"/> 
		<bitfield id="PRD" width="1" begin="1" end="1" resetval="0x0" description="Enable event time-base counter equal to period  [TBCTR = TBPRD] to the blanking window trigger [BLANKPULSEMIX].    0: Period match event is not enabled  1: Enable period match event" range="1" rwaccess="R/W"/> 
		<bitfield id="ZRO" width="1" begin="0" end="0" resetval="0x0" description="Enable event time-base counter equal to zero [TBCTR = 0x00] to the blanking window trigger [BLANKPULSEMIX].    0: Zero match event is not enabled  1: Enable zero match event" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM7_DCCAPMIXSEL" acronym="CONTROLSS_G0_EPWM7_DCCAPMIXSEL" offset="0x19C" width="16" description="Capture Event pulse select register">
		<bitfield id="CDD" width="1" begin="9" end="9" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is decrementing to the blanking window trigger [DCCAPMIX].    0: CMPD down-count match enable event is not enabled  1: Enable CMPD down-count match enable event" range="9" rwaccess="R/W"/> 
		<bitfield id="CDU" width="1" begin="8" end="8" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is incrementing to the blanking window trigger [DCCAPMIX].    0: CMPD up-count match enable event is not enabled  1: Enable CMPD up-count match enable event" range="8" rwaccess="R/W"/> 
		<bitfield id="CCD" width="1" begin="7" end="7" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is decrementing to the blanking window trigger [DCCAPMIX].    0: CMPC down-count match enable event is not enabled  1: Enable CMPC down-count match enable event" range="7" rwaccess="R/W"/> 
		<bitfield id="CCU" width="1" begin="6" end="6" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is incrementing to the blanking window trigger [DCCAPMIX].    0: CMPC up-count match enable event is not enabled  1: Enable CMPC up-count match enable event" range="6" rwaccess="R/W"/> 
		<bitfield id="CBD" width="1" begin="5" end="5" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is decrementing to the blanking window trigger [DCCAPMIX].    0: CMPB down-count match enable event is not enabled  1: Enable CMPB down-count match enable event" range="5" rwaccess="R/W"/> 
		<bitfield id="CBU" width="1" begin="4" end="4" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is incrementing to the mixed ET interrupt trigger signal [DCCAPMIX].    0: CMPB up-count match enable event is not enabled  1: Enable CMPB up-count match enable event" range="4" rwaccess="R/W"/> 
		<bitfield id="CAD" width="1" begin="3" end="3" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is decrementing to the blanking window trigger [DCCAPMIX].    0: CMPA down-count match enable event is not enabled  1: Enable CMPA down-count match enable event" range="3" rwaccess="R/W"/> 
		<bitfield id="CAU" width="1" begin="2" end="2" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is incrementing to the blanking window trigger [DCCAPMIX].    0: CMPA up-count match enable event is not enabled  1: Enable CMPA up-count match enable event" range="2" rwaccess="R/W"/> 
		<bitfield id="PRD" width="1" begin="1" end="1" resetval="0x0" description="Enable event time-base counter equal to period  [TBCTR = TBPRD] to the blanking window trigger [DCCAPMIX].    0: Period match event is not enabled  1: Enable period match event" range="1" rwaccess="R/W"/> 
		<bitfield id="ZRO" width="1" begin="0" end="0" resetval="0x0" description="Enable event time-base counter equal to zero [TBCTR = 0x00] to the blanking window trigger [DCCAPMIX].    0: Zero match event is not enabled  1: Enable zero match event" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM7_DCCAP" acronym="CONTROLSS_G0_EPWM7_DCCAP" offset="0x19E" width="16" description="Digital Compare Counter Capture Register ">
		<bitfield id="DCCAP" width="16" begin="15" end="0" resetval="0x0" description="Digital Compare Time-Base Counter Capture  To enable time-base counter capture, set the DCCAPCLT[CAPE] bit to 1. If enabled, reflects the value of the time-base counter [TBCTR] on the low to high edge transition of a filtered [DCEVTFLT] event. Further capture events are ignored until the next period or zero as selected by the DCFCTL[PULSESEL] bit. Shadowing of DCCAP is enabled and disabled by the DCCAPCTL[SHDWMODE] bit. By default this register is shadowed. - If DCCAPCTL[SHDWMODE] = 0, then the shadow is enabled. In this mode, the active register is copied to the shadow register on the TBCTR = TBPRD or TBCTR = zero as defined by the DCFCTL[PULSESEL] bit. CPU reads of this register will return the shadow register value. - If DCCAPCTL[SHDWMODE] = 1, then the shadow register is disabled. In this mode, CPU reads will return the active register value. The active and shadow registers share the same memory map address." range="15 - 0" rwaccess="R"/>
	</register>
